/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstclear.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/19 00:29:37 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/19 00:40:07 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*
** Удаляет и освобождает данный элемент и каждый
** преемник этого элемента, используя функцию ’del’ и бесплатно (3).
** Наконец, указатель на список должен быть установлен на НУЛЕВОЙ.
*/

void ft_lstclear(t_list **lst, void (*del)(void*))
{
	t_list *save;

	if(!del || !lst || !*lst)
		return ;
		while(*lst && lst)
		{
			save = (*lst) -> next;
			ft_lstdelone(*lst, del);
			*lst = save;
		}
}
