/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/18 23:59:29 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/20 18:04:22 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
 ** Подсчитывает количество элементов в списке.
*/

int	ft_lstsize(t_list *lst)
{
	int	lenlist;

	lenlist = 0;
	while (lst)
	{
		lenlist++;
		lst = lst -> next;
	}
	return (lenlist);
}
