/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/19 00:10:43 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/19 00:15:22 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*
** Возвращает последний элемент списка.
*/

t_list	*ft_lstlast(t_list *lst)
{
		if(!lst)
			return (NULL);
	while(lst->next)
		lst = lst ->next;
	return (lst);
}
