/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strtrim.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 17:42:27 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/15 21:30:53 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Выделяет (с помощью malloc (3)) и возвращает копию
** ’S1’ с удаленными символами, указанными в ’set’ от начала и до конца строки.
**
** RETURN
**
** Обрезаемая строка.
** Контрольный набор символов для обрезки.
*/

//char	*ft_strtrim(char const *s1, char const *set)
//{
//
//}