/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/15 15:29:38 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/15 16:10:08 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функции strcpy () копируют строку src в dst
** (включая завершающий символ `\0'.)
** Если копирование происходит между перекрывающимися объектами,
** поведение не определено
**
** RETURN
**
** Функция strcpy () должна вернуть dst ;
** возвращаемое значение не зарезервировано, чтобы указать на ошибку.
**
*/

char	*ft_strcpy(char *dst, const char *src)
{
	int	i;

	i = 0;
	while (str[i] != '\0')
	{
		dst[i] = src[i];
		i++;
	}
	dst[i] = 0;
	return (dst);
}
