/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_split.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlamonic <jlamonic@student.42.fr> >        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/14 21:44:54 by jlamonic          #+#    #+#             */
/*   Updated: 2021/10/14 21:46:31 by jlamonic         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Описание
** выделяет (с помощью malloc(3)) и возвращает массив
** строк, полученный путем разбиения ’s’ с использованием
** символа ’c’ в качестве разделителя. Массив должен
** заканчиваться нулевым указателем.
**
** RETURN
** Возвращает значение массива новых строк,
** полученного в результате разделения.
** NULL, если выделение не удается.
*/

char	**ft_split(char const *s, char c)
{

}